---
kind: property
id: P:Autodesk.Revit.DB.Architecture.CutMarkType.CutLineExtension
source: html/e1022565-c6b2-8c1a-1a84-cb47f9ab2c68.htm
---
# Autodesk.Revit.DB.Architecture.CutMarkType.CutLineExtension Property

The extension distance to the boundary.

## Syntax (C#)
```csharp
public double CutLineExtension { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for extensionDistanceToBoundary must be between 0 and 30000 feet.